app/controllers/posts_controller.rb

SELECT * FROM "posts" ORDER BY created_at DESC
---
	def index
		@posts = Post.all(:order => "created_at DESC")

INSERT INTO "posts" ("created_at", "updated_at", "message") VALUES('2009-08-12 01:28:51', '2009-08-12 01:28:51', 'estudando!')
---
	def create
		@post = Post.create(:message => params[:message])